##### 1. Establish a connection between Python and the Sakila database.

In [1]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
import getpass  
password = getpass.getpass()

········

In [54]:
bd = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+bd
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [55]:
from sqlalchemy import text

##### 2. Write a Python function called `rentals_month` that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

	- `engine`: an object representing the database connection engine to be used to establish a connection to the Sakila database.
	- `month`: an integer representing the month for which rental data is to be retrieved.
	- `year`: an integer representing the year for which rental data is to be retrieved.

In [56]:
def rentals_month(engine, month, year):
    with engine.connect() as connection:
        txt = f'''SELECT *, YEAR(rental_date) AS YEAR, MONTH(rental_date) AS MONTH
                  FROM sakila.rental
                  WHERE YEAR(rental_date) = {year} AND MONTH(rental_date) = {month};'''
        query = text(txt)
        result = connection.execute(query)
        df_1 = pd.DataFrame(result.all())
        return df_1

In [57]:
rentals_month(engine, 5 , 2005)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,YEAR,MONTH
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,2005,5
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,2005,5
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,2005,5
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,2005,5
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,2005,5
...,...,...,...,...,...,...,...,...,...
1151,1153,2005-05-31 21:36:44,2725,506,2005-06-10 01:26:44,2,2006-02-15 21:30:53,2005,5
1152,1154,2005-05-31 21:42:09,2732,59,2005-06-08 16:40:09,1,2006-02-15 21:30:53,2005,5
1153,1155,2005-05-31 22:17:11,2048,251,2005-06-04 20:27:11,2,2006-02-15 21:30:53,2005,5
1154,1156,2005-05-31 22:37:34,460,106,2005-06-01 23:02:34,2,2006-02-15 21:30:53,2005,5
1155,1157,2005-05-31 22:47:45,1449,61,2005-06-02 18:01:45,1,2006-02-15 21:30:53,2005,5

##### 3. Develop a Python function called `rental_count_month` that takes the DataFrame provided by `rentals_month` as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year. 

	The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".


	*Hint: Consider making use of pandas

In [60]:
def rental_count_month(df_1, year, month):
    with engine.connect() as connection:
        txt = f'''SELECT customer_id, YEAR(rental_date) , MONTH(rental_date), COUNT(rental_id) AS rental_count
                  FROM sakila.rental
                  WHERE YEAR(rental_date) = {year} AND MONTH(rental_date) = {month}
                  GROUP BY customer_id;'''
        query = text(txt)
        result = connection.execute(query)
        df_2 = pd.DataFrame(result.all())
        return df_2

In [61]:
rental_count_month(engine, 2005, 6)

     customer_id  YEAR(rental_date)  MONTH(rental_date)  rental_count
0              1               2005                   6             7
1              2               2005                   6             1
2              3               2005                   6             4
3              4               2005                   6             6
4              5               2005                   6             5
..           ...                ...                 ...           ...
585          595               2005                   6             2
586          596               2005                   6             2
587          597               2005                   6             3
588          598               2005                   6             1
589          599               2005                   6             4

[590 rows x 4 columns]

##### 4. Create a Python function called `compare_rentals` that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. 
The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [62]:
def compare_rentals(df_1, df_2):
    combined_df = pd.merge(df_1, df_2, on = "customer_id", how = "inner")
    combined_df["difference"] = df_1['rental_count'] - df_2["rental_count"]
    return combined_df

In [63]:
df_1 = rental_count_month(engine, 2005, 6)
df_2 = rental_count_month(engine, 2005, 5)

In [64]:
compare_rentals(df_1, df_2)

,customer_id,YEAR(rental_date)_x,MONTH(rental_date)_x,rental_count_x,YEAR(rental_date)_y,MONTH(rental_date)_y,rental_count_y,difference
0,1,2005,6,7,2005,5,2,5.0
1,2,2005,6,1,2005,5,1,0.0
2,3,2005,6,4,2005,5,2,2.0
3,5,2005,6,5,2005,5,3,3.0
4,6,2005,6,4,2005,5,3,2.0
...,...,...,...,...,...,...,...,...
507,594,2005,6,6,2005,5,4,4.0
508,595,2005,6,2,2005,5,1,-1.0
509,596,2005,6,2,2005,5,6,1.0
510,597,2005,6,3,2005,5,2,1.0
511,599,2005,6,4,2005,5,1,0.0